uhnp/src/Documents/ПокрытиеПотребностиВФинансировании/ПокрытиеПотребностиВФинансировании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокрытиеПотребностиВФинансировании</name>
  <basedOn>Document.ЗаявкаНаПривлечениеФинансирования</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.ЛимитыРамочныхДоговоровКредитовЗаймов</registerRecords>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойВариантФинансирования</name>
    <type>
      <types>CatalogRef.ВариантыФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПревышениеЛимитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаявкиНаПривлечениеФинансирования</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПривлечениеФинансирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/ТипыСтавокДляРасчетаПериодическихОпераций/ТипыСтавокДляРасчетаПериодическихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтавокДляРасчетаПериодическихОпераций</name>
  <enumValues>
    <name>Фиксированная</name>
  </enumValues>
  <enumValues>
    <name>Дифференцированная</name>
  </enumValues>
  <enumValues>
    <name>Плавающая</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПокрытиеПотребностиВФинансировании/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Контроль документа	
	КонтрольУХ.ПодготовитьФормуНаСервере(ЭтотОбъект, Элементы.ГруппаСтраницы);
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

	ОпределитьСостояниеОбъекта();
	ЗаполнитьВариантыФинансирования(); 
	
	МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
    Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
         МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
         МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    КонецЕсли;
    // Конец СтандартныеПодсистемы.УправлениеДоступом
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта();
	ИначеЕсли ИмяСобытия = "ОбновлениеВариантаФинансирования"
		И Источник = Объект.ОсновнойВариантФинансирования Тогда
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
	
	Если Не Объект.Проведен Тогда
		ПриОжиданииВыполнитьКонтрольДокумента();   
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "СостояниеЗаявки") Тогда
		ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма);
		УстановитьОформлениеКнопкиОК();
	КонецЕсли;
	
	КонтрольУХ.ИнициализироватьРезультатыКонтроля(ЭтотОбъект); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриОжиданииВыполнитьКонтрольДокумента();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВариантыФинансирования
&НаКлиенте
Процедура ВариантыФинансированияПометкаПриИзменении(Элемент)
	
	НовыйВариант 	= Элементы.ВариантыФинансирования.ТекущиеДанные.Вариант;
	ТекущаяОтметка 	= Элементы.ВариантыФинансирования.ТекущиеДанные.Пометка;
	Для каждого СтрокаВариантов Из ВариантыФинансирования Цикл
		Если СтрокаВариантов.Вариант <> НовыйВариант Тогда
		  	СтрокаВариантов.Пометка = Ложь;		
		КонецЕсли; 	                                                     		
	КонецЦикла;  
	Если ТекущаяОтметка Тогда
		Объект.ОсновнойВариантФинансирования 	= НовыйВариант;
	Иначе
		Объект.ОсновнойВариантФинансирования 	= ПредопределенноеЗначение("Справочник.ВариантыФинансирования.ПустаяСсылка");
	КонецЕсли;
	
	Модифицированность 			= Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВариантыФинансированияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Вариант) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Вариант);                                 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьУдаленныеВариантыПриИзменении(Элемент)
	ЗаполнитьВариантыФинансирования();
КонецПроцедуры

&НаКлиенте
Процедура ВариантыФинансированияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыФинансированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКомандуУХ(Команда)
	
	Если Команда.Имя = "ВыполнитьКонтрольДокумента" Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьКонтрольДокумента", 0.5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//// ОПК
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтотОбъект);	
	// Конец ОПК 
	ОбщегоНазначенияУХ.УстановитьСостояниеДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьМастерВариантов(Команда)
    Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Не выбрана валюта документа. Запуск мастера не возможен'"));
		Возврат;
	КонецЕсли;
 
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗапуститьМастерВариантовПродолжение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Операция возможна только после записи документа.
				|Данные будут записаны'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	ЗапуститьМастерВариантовКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьМастерВариантовПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ЗапуститьМастерВариантовКлиент();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗапуститьМастерВариантовКлиент()

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация");
	СтруктураПараметров.Вставить("ДатаОкончанияДействия");
	СтруктураПараметров.Вставить("ДатаНачалаДействия");
	СтруктураПараметров.Вставить("ВидФинансирования");
	СтруктураПараметров.Вставить("СуммаДокумента");
	СтруктураПараметров.Вставить("ВалютаДокумента");	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);                                                                                          
	СтруктураПараметров.Вставить("ДокументСсылка", Объект.Ссылка);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗапускМастераЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВариантыФинансирования.Форма.ФормаМастера", СтруктураПараметров, ЭтотОбъект
					,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗапускМастераЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Модифицированность		= Истина;

	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.ОсновнойВариантФинансирования 	= РезультатЗакрытия; 	
	КонецЕсли;
    
	ЗаполнитьВариантыФинансирования(); 
	ПриОжиданииВыполнитьКонтрольДокумента();
    
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура УдалитьТекущийВариант(Команда)
	ТекущиеДанные = Элементы.ВариантыФинансирования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	                                 
	КонецЕсли;
	УдалитьВариантНаСервере(ТекущиеДанные.Вариант);
	ЗаполнитьВариантыФинансирования();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйВариант(Команда) 

	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовыйВариантПродолжение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Операция возможна только после записи документа.
				|Данные будут записаны'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	СоздатьНовыйВариантКлиент();

КонецПроцедуры    

&НаКлиенте
Процедура СоздатьНовыйВариантПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		СоздатьНовыйВариантКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйВариантКлиент()
	
   	ЭлементыОтбора = Новый Структура("ПокрытиеПотребностиВФинансировании", Объект.Ссылка);
	ЭлементыОтбора.Вставить("Организация", 		Объект.Организация); 
	ЭлементыОтбора.Вставить("ОбщаяСумма",		Объект.СуммаДокумента); 
	ЭлементыОтбора.Вставить("ВалютаДокумента",  Объект.ВалютаДокумента);
	ЭлементыОтбора.Вставить("ДатаНачалаДействия",		Объект.ДатаНачалаДействия);
	ЭлементыОтбора.Вставить("ДатаОкончанияДействия",	Объект.ДатаОкончанияДействия);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОповещениеНовогоЭлемента = Новый ОписаниеОповещения("ОбработатьСозданиеНовогоВарианта", ЭтотОбъект);	
	ОткрытьФорму("Справочник.ВариантыФинансирования.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект,
				,,, ОповещениеНовогоЭлемента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры 
&НаКлиенте
Процедура ОбработатьСозданиеНовогоВарианта(Результат, Параметры) Экспорт
	
	ЗаполнитьВариантыФинансирования();
	ПриОжиданииВыполнитьКонтрольДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет доступные варианты финансирования
//
&НаСервере
Процедура ЗаполнитьВариантыФинансирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыФинансирования.Ссылка КАК Вариант,
		|	ВариантыФинансирования.ВидФинансирования КАК ВидФинансирования,
		|	ВариантыФинансирования.Контрагент КАК Контрагент,
		|	ВариантыФинансирования.ПокрытиеПотребностиВФинансировании КАК ПокрытиеПотребностиВФинансировании,
		|	ВариантыФинансирования.ОбщаяСуммаПроцентов КАК ОбщаяСуммаПроцентов,
		|	ВариантыФинансирования.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	ВариантыФинансирования.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ВариантыФинансирования.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ВариантыФинансирования.ИндикативнаяСтавка КАК ИндикативнаяСтавка,
		|	ПРЕДСТАВЛЕНИЕ(ВариантыФинансирования.ИндикативнаяСтавка) КАК ИндикативнаяСтавкаПредставление,
		|	ВариантыФинансирования.ТипПроцентнойСтавки КАК ТипПроцентнойСтавки
		|ИЗ
		|	Справочник.ВариантыФинансирования КАК ВариантыФинансирования
		|ГДЕ
		|	(НЕ ВариантыФинансирования.ПометкаУдаления
		|			ИЛИ &ОтображатьУдаленныеВарианты)
		|	И ВариантыФинансирования.ПокрытиеПотребностиВФинансировании = &Заявка";

	Запрос.УстановитьПараметр("Заявка", 						Объект.Ссылка);
	Запрос.УстановитьПараметр("ОтображатьУдаленныеВарианты", 	ОтображатьУдаленныеВарианты > 0 );
	
	РезультатЗапроса 		= Запрос.Выполнить();
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	ВариантыФинансирования.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЗ 			= ВариантыФинансирования.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, ВыборкаДетальныеЗаписи);
		Если СтрокаТЗ.Вариант = Объект.ОсновнойВариантФинансирования Тогда
			СтрокаТЗ.Пометка = Истина;		
		КонецЕсли;  
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИндикативнаяСтавка)
				И	ВыборкаДетальныеЗаписи.ТипПроцентнойСтавки <> Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная Тогда
			ПроцентнаяСтавкаСтрока = СтрШаблон(НСтр("ru='%1 + %2 %3'"), 
										ВыборкаДетальныеЗаписи.ИндикативнаяСтавкаПредставление,
										ВыборкаДетальныеЗаписи.ПроцентнаяСтавка, 
										"%");
			СтрокаТЗ.ПроцентнаяСтавкаСтрока = ПроцентнаяСтавкаСтрока;
		Иначе
			СтрокаТЗ.ПроцентнаяСтавкаСтрока = Строка(ВыборкаДетальныеЗаписи.ПроцентнаяСтавка) + " %";			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // ()

&НаКлиенте
Процедура ПриОжиданииВыполнитьКонтрольДокумента()
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьКонтрольДокумента", 0.5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКонтрольДокумента()
	ВыполнитьКонтрольДокумента();		
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКонтрольДокумента()
	КонтрольУХКлиентСервер.ВыполнитьИнтерактивныйКонтроль(ЭтотОбъект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ТаблицаКонтроляДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД =  Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КонтрольУХКлиент.ПоказатьРасшифровкуКонтроля(Объект, ТД);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаКонтроляДокументаПриАктивизацииЯчейки(Элемент)
	Элемент.ТекущаяСтрока = Неопределено;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВариантНаСервере(Вариант)

	ВариантОбъект = Вариант.ПолучитьОбъект();
	ВариантОбъект.УстановитьПометкуУдаления(Истина);

КонецПроцедуры

#Область ВызовыОбщихПроцедурИФункцийСогласованияОбъектов

&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "СостояниеЗаявки") Тогда
		ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтотОбъект, ОбновитьОтветственныхВход);
		УстановитьОформлениеКнопкиОК();
	Иначе
		// Панель согласования еще не создана.
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеКнопкиОК()
	Если Элементы.Найти("КнопкаОК") <> Неопределено Тогда
		Если РеквизитСостояниеЗаявки(ЭтотОбъект) = Перечисления.СостоянияСогласования.Черновик И ЗначениеЗаполнено(РеквизитСогласующий(ЭтотОбъект)) Тогда 
			Элементы.КнопкаОК.Заголовок = НСтр("ru = 'На согласование'");
			Элементы.КнопкаОК.Картинка = БиблиотекаКартинок.Утвердить;
		Иначе
			Элементы.КнопкаОК.Заголовок = НСтр("ru = 'Провести и закрыть'");
			Элементы.КнопкаОК.Картинка = Новый Картинка;
		КонецЕсли;
	Иначе
		// Элемент не найден. Например, у пользователя нет прав на запись документа.
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
	
КонецПроцедуры

// Проверяет сохранение текущего объекта и изменяет его статус
// НовоеЗначениеСтатусаВход.
&НаКлиенте
Процедура ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатусаВход)
	Если (Объект.Ссылка.Пустая()) ИЛИ (Модифицированность) Тогда
		СтруктураПараметров = Новый Структура("ВыбранноеЗначение", НовоеЗначениеСтатусаВход);
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, СтруктураПараметров);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Изменение состояния возможно только после записи данных.
		|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ИзменитьСостояниеЗаявкиКлиент(НовоеЗначениеСтатусаВход);	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОрганизации_Подключаемый(Элемент) Экспорт
	ОпределитьСостояниеОбъекта(Истина);		
	ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент);
КонецПроцедуры		// ПриИзмененииЭлементаОрганизации_Подключаемый()

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСтатусОбъекта(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
КонецПроцедуры

// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)
	#Если Не ВебКлиент Тогда
	ИмяЭлемента = Элемент.Имя;
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтотОбъект["ОбработчикиИзмененияОрганизации"] Цикл
			Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
				СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
				Выполнить СтрокаВыполнения;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли; 
		КонецЦикла;	
	Иначе
		// Передан пустой элемент.
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры		// ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()	

#КонецОбласти

#КонецОбласти
